In [1]:
import pandas as pd

df = pd.read_csv('./assets/Students_exams_error.csv')
df

     gender math score  reading score  writing score
0    female         72           72.0           74.0
1       NaN         69           90.0           88.0
2    female         90           95.0           93.0
3      male         47            NaN           44.0
4      male        abc            NaN           75.0
..      ...        ...            ...            ...
995  female         88           99.0           95.0
996    male         62           55.0           55.0
997  female         59           71.0           65.0
998  female         68           78.0           77.0
999  female         77           86.0           86.0

[1000 rows x 4 columns]

In [2]:
df.isnull().sum()

gender           2
math score       0
reading score    3
writing score    3
dtype: int64

In [3]:
for col in df[["math score", "reading score", "writing score"]]:
    df[col] = pd.to_numeric(df[col], errors="coerce")

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   gender         998 non-null    object
 1   math score     998 non-null    float64
 2   reading score  997 non-null    float64
 3   writing score  997 non-null    float64
dtypes: float64(3), object(1)
memory usage: 31.4+ KB

In [4]:
df.head(20)

    gender  math score  reading score  writing score
0   female        72.0           72.0           74.0
1      NaN        69.0           90.0           88.0
2   female        90.0           95.0           93.0
3     male        47.0            NaN           44.0
4     male         NaN            NaN           75.0
5   female        71.0            NaN          500.0
6   female        88.0           95.0           92.0
7      NaN        40.0           43.0           39.0
8     male         NaN           64.0           67.0
9   female        38.0           60.0           50.0
10    male        58.0           54.0            NaN
11    male        40.0           52.0           43.0
12  female        65.0           81.0          400.0
13    male        78.0           72.0           70.0
14  female        50.0           53.0           58.0
15  female        69.0           75.0           78.0
16    male        88.0           89.0           86.0
17  female        18.0           32.0           28.0
18    male        46.0           42.0           46.0
19  female        54.0           58.0           61.0

In [5]:
# Remplacer NaN dans la colonne gender par Unknown

In [13]:
df['gender'] = df['gender'].fillna(value="Unknown")
df.head(10)

    gender  math score  reading score  writing score
0   female        72.0           72.0           74.0
1  Unknown        69.0           90.0           88.0
2   female        90.0           95.0           93.0
3     male        47.0            0.0           44.0
4     male         0.0            0.0           75.0
5   female        71.0            0.0          500.0
6   female        88.0           95.0           92.0
7  Unknown        40.0           43.0           39.0
8     male         0.0           64.0           67.0
9   female        38.0           60.0           50.0

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   gender         998 non-null    object
 1   math score     998 non-null    float64
 2   reading score  997 non-null    float64
 3   writing score  997 non-null    float64
dtypes: float64(3), object(1)
memory usage: 31.4+ KB

In [8]:
# Remplacer NaN dans les colonnes math score, reading score et writing score par la valeur 00.0. 
# On peut de meme remplacer les valeurs par une valeur moyenne .mean()

In [9]:
#for col in df[["math score", "reading score", "writing score"]]:
    #df[col] = df[col].fillna(df[col].mean())

#df.head(10)

In [14]:
df.head(10)

    gender  math score  reading score  writing score
0   female        72.0           72.0           74.0
1  Unknown        69.0           90.0           88.0
2   female        90.0           95.0           93.0
3     male        47.0            0.0           44.0
4     male         0.0            0.0           75.0
5   female        71.0            0.0          500.0
6   female        88.0           95.0           92.0
7  Unknown        40.0           43.0           39.0
8     male         0.0           64.0           67.0
9   female        38.0           60.0           50.0

In [15]:
for col in df[["math score", "reading score", "writing score"]]:
    df[col] = df[col].fillna(value = 00.0)

df.head(10)

    gender  math score  reading score  writing score
0   female        72.0           72.0           74.0
1  Unknown        69.0           90.0           88.0
2   female        90.0           95.0           93.0
3     male        47.0            0.0           44.0
4     male         0.0            0.0           75.0
5   female        71.0            0.0          500.0
6   female        88.0           95.0           92.0
7  Unknown        40.0           43.0           39.0
8     male         0.0           64.0           67.0
9   female        38.0           60.0           50.0

In [16]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   gender         1000 non-null   object
 1   math score     1000 non-null   float64
 2   reading score  1000 non-null   float64
 3   writing score  1000 non-null   float64
dtypes: float64(3), object(1)
memory usage: 31.4+ KB

In [ ]:
df['writing score'] = df